## Production: newrelic
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                         |
|--------|--------------------------------------------------------------------------------------|
| add    | `newrelic_alert_policy.terraform_notify_policy`                                      |
|        | `newrelic_notification_channel.terraform_notify_channel`                             |
|        | `newrelic_notification_destination.terraform_notify_destination`                     |
|        | `newrelic_nrql_alert_condition.tf_lambda_api_errors_count_anomaly_unexpected_errors` |
|        | `newrelic_workflow.terraform_notify_workflow`                                        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_alert_policy.terraform_notify_policy will be created
  + resource "newrelic_alert_policy" "terraform_notify_policy" {
      + account_id          = (known after apply)
      + id                  = (known after apply)
      + incident_preference = "PER_POLICY"
      + name                = "TF Notify Policy - production"
    }

  # newrelic_notification_channel.terraform_notify_channel will be created
  + resource "newrelic_notification_channel" "terraform_notify_channel" {
      + account_id     = (known after apply)
      + active         = true
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "Terraform Notify Slack Channel - production"
      + product        = "IINT"
      + status         = (known after apply)
      + type           = "SLACK_LEGACY"

      + property {
          + key   = "payload"
          + label = "Payload Template"
          + value = jsonencode({})
        }
    }

  # newrelic_notification_destination.terraform_notify_destination will be created
  + resource "newrelic_notification_destination" "terraform_notify_destination" {
      + account_id = 2691974
      + active     = true
      + guid       = (known after apply)
      + id         = (known after apply)
      + last_sent  = (known after apply)
      + name       = "Terraform Notify Slack Destination - production"
      + status     = (known after apply)
      + type       = "SLACK_LEGACY"

      + property {
          + display_value = "notification-ops"
          + key           = "url"
          + value         = "https://hooks.slack.com/services/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"
        }
    }

  # newrelic_nrql_alert_condition.tf_lambda_api_errors_count_anomaly_unexpected_errors will be created
  + resource "newrelic_nrql_alert_condition" "tf_lambda_api_errors_count_anomaly_unexpected_errors" {
      + account_id                   = 2691974
      + aggregation_delay            = "300"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + baseline_direction           = "upper_and_lower"
      + enabled                      = true
      + entity_guid                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "production - Terraform - [Lambda API] Errors count anomaly (Unexpected Errors)"
      + policy_id                    = (known after apply)
      + type                         = "baseline"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 86400

      + critical {
          + operator              = "above"
          + threshold             = 6
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT count(*) FROM AwsLambdaInvocationError WHERE (`entityGuid`='MjY5MTk3NHxJTkZSQXxOQXwxMDg0NzM0MjU4MTkwNzk3NTQz') and error.class NOT IN ('app.v2.errors:BadRequestError','jsonschema.exceptions:ValidationError', 'sqlalchemy.exc:NoResultFound', 'app.authentication.auth:AuthError', 'werkzeug.exceptions:MethodNotAllowed') and error.message NOT LIKE '{\\'result\\': \\'error\\', \\'message\\': {\\'password\\': [\\'Incorrect password\\']}}'"
        }

      + warning {
          + operator              = "above"
          + threshold             = 3
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }
    }

  # newrelic_workflow.terraform_notify_workflow will be created
  + resource "newrelic_workflow" "terraform_notify_workflow" {
      + account_id            = 2691974
      + destinations_enabled  = true
      + enabled               = true
      + enrichments_enabled   = true
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + last_run              = (known after apply)
      + muting_rules_handling = "DONT_NOTIFY_FULLY_MUTED_ISSUES"
      + name                  = "Terraform Notify Workflow - production"
      + workflow_id           = (known after apply)

      + destination {
          + channel_id              = (known after apply)
          + name                    = (known after apply)
          + notification_triggers   = (known after apply)
          + type                    = (known after apply)
          + update_original_message = true
        }

      + issues_filter {
          + filter_id = (known after apply)
          + name      = "workflow-filter"
          + type      = "FILTER"

          + predicate {
              + attribute = "labels.policyIds"
              + operator  = "EXACTLY_MATCHES"
              + values    = (known after apply)
            }
          + predicate {
              + attribute = "priority"
              + operator  = "EQUAL"
              + values    = [
                  + "CRITICAL",
                ]
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

